nhattquangg2003-tech/STM32-SELF-LEARNING/timer_OC_1/Core/Src/main.c
/*
 * main.c
 *
 *  Created on: Mar 2, 2026
 *      Author: Owner
 */
#include "main.h"
#include "stm32f1xx_hal.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>
// declare function
void SystemClockConfig(uint8_t clock_freq);
void Error_handler(void);
void TIMER2_Init(void);
void GPIO_Init(void);
void MX_USART2_UART_Init(void);
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim);
// private variable
TIM_HandleTypeDef htimer2;
UART_HandleTypeDef huart2;


uint32_t pulse1_value = 5000; // to produce 500hz
uint32_t pulse2_value = 14000; // to produce 1000hz
uint32_t pulse3_value = 7000; // to produce 2000hz
uint32_t pulse4_value = 3500; // to produce 4000hz
uint32_t ccr_content = 0;
// main
int main (void)
{

	HAL_Init();

	SystemClockConfig(SYS_CLOCK_FREQ_56_MHZ);

	GPIO_Init();

	TIMER2_Init();

	MX_USART2_UART_Init();


	// start the tim2
	if (HAL_TIM_OC_Start_IT(&htimer2,TIM_CHANNEL_1) != HAL_OK)
	{
		Error_handler();
	}

	if (HAL_TIM_OC_Start_IT(&htimer2,TIM_CHANNEL_2) != HAL_OK)
	{
		Error_handler();
	}
	if (HAL_TIM_OC_Start_IT(&htimer2,TIM_CHANNEL_3) != HAL_OK)
	{
		Error_handler();
	}
	if (HAL_TIM_OC_Start_IT(&htimer2,TIM_CHANNEL_4) != HAL_OK)
	{
		Error_handler();
	}


	// config uart to transmit data
	char *user_data = "The UART2 is working\n";
	uint16_t len_of_data = strlen(user_data);
	HAL_UART_Transmit(&huart2,(uint8_t*)user_data,len_of_data, HAL_MAX_DELAY);
	while(1)
	{

	}



	return 0;
}


void SystemClockConfig(uint8_t clock_freq)
{
	RCC_OscInitTypeDef Osc_Init = {0};
	RCC_ClkInitTypeDef Clock_Init = {0};

	// F103 dùng HSI 8MHz làm nguồn PLL
	Osc_Init.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
	Osc_Init.HSIState = RCC_HSI_ON;
	Osc_Init.HSEState = RCC_HSE_ON;
	Osc_Init.HSIState = RCC_HSI_ON;
	Osc_Init.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	Osc_Init.PLL.PLLState = RCC_PLL_ON;
	Osc_Init.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2; // HSI/2 = 4MHz vào PLL

	switch(clock_freq)
	{
	case SYS_CLOCK_FREQ_36_MHZ:
		// 4MHz × 9 = 36MHz
		Osc_Init.PLL.PLLMUL = RCC_PLL_MUL9;
		Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
				RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV1; // APB1 max 36MHz → OK
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
		break;

	case SYS_CLOCK_FREQ_56_MHZ:
		// 4MHz × 14 = 56MHz
		Osc_Init.PLL.PLLMUL = RCC_PLL_MUL14;
		Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
				RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2; // APB1 max 36MHz → 56/2=28MHz OK
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
		break;

	case SYS_CLOCK_FREQ_72_MHZ:
		Osc_Init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
		Osc_Init.HSEState = RCC_HSE_ON;
		Osc_Init.PLL.PLLSource = RCC_PLLSOURCE_HSE; // HSE 8MHz
		Osc_Init.PLL.PLLMUL = RCC_PLL_MUL9;         // 8MHz × 9 = 72MHz ✅
		Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2;  // 36MHz
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;  // 72MHz
		break;

	default:
		return;
	}


	HAL_RCC_OscConfig(&Osc_Init);
	HAL_RCC_ClockConfig(&Clock_Init, FLASH_LATENCY_2);

	/*Configure the systick timer interrupt frequency (for every 1 ms) */
	uint32_t hclk_freq = HAL_RCC_GetHCLKFreq();
	HAL_SYSTICK_Config(hclk_freq/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

}
/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_handler(void)
{
	while(1);
}
//
//
//
void TIMER2_Init(void)
{
	TIM_OC_InitTypeDef time2OC_init;
	htimer2.Instance = TIM2;
	htimer2.Init.Period = 0XFFFF;
	htimer2.Init.Prescaler = 5599;
	htimer2.Init.CounterMode = TIM_COUNTERMODE_UP;
	if (HAL_TIM_OC_Init(&htimer2) != HAL_OK)
	{
		Error_handler();
	}
	time2OC_init.OCMode = TIM_OCMODE_TOGGLE;
	time2OC_init.OCPolarity = TIM_OCPOLARITY_HIGH;
	time2OC_init.Pulse = pulse1_value;

	if (HAL_TIM_OC_ConfigChannel(&htimer2, &time2OC_init, TIM_CHANNEL_1) != HAL_OK)
	{
		Error_handler();
	}
	time2OC_init.Pulse = pulse2_value;
	if (HAL_TIM_OC_ConfigChannel(&htimer2, &time2OC_init, TIM_CHANNEL_2) != HAL_OK)
	{
		Error_handler();
	}
	time2OC_init.Pulse = pulse3_value;
	if (HAL_TIM_OC_ConfigChannel(&htimer2, &time2OC_init, TIM_CHANNEL_3) != HAL_OK)
	{
		Error_handler();
	}
	time2OC_init.Pulse = pulse4_value;
	if (HAL_TIM_OC_ConfigChannel(&htimer2, &time2OC_init, TIM_CHANNEL_4) != HAL_OK)
	{
		Error_handler();
	}

}
//
//
//
void GPIO_Init(void)
{
	// LED PB2
	__HAL_RCC_GPIOB_CLK_ENABLE();
	GPIO_InitTypeDef ledgpio = {0};
	ledgpio.Mode = GPIO_MODE_OUTPUT_PP;
	ledgpio.Pin = GPIO_PIN_2;
	ledgpio.Pull = GPIO_NOPULL;
	ledgpio.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOB, &ledgpio);

	__HAL_RCC_GPIOA_CLK_ENABLE();
	GPIO_InitTypeDef gpio_toggle = {0};
	gpio_toggle.Mode = GPIO_MODE_OUTPUT_PP;
	gpio_toggle.Pin = GPIO_PIN_5;
	gpio_toggle.Pull = GPIO_NOPULL;
	gpio_toggle.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &gpio_toggle);

}
/**
 * @brief USART2 Initialization Function
 * @param None
 * @retval None
 */
void MX_USART2_UART_Init(void)
{

	/* USER CODE BEGIN USART2_Init 0 */

	/* USER CODE END USART2_Init 0 */

	/* USER CODE BEGIN USART2_Init 1 */

	/* USER CODE END USART2_Init 1 */
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 115200;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.Mode = UART_MODE_TX_RX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;
	if (HAL_UART_Init(&huart2) != HAL_OK)
	{
		Error_handler();
	}
	/* USER CODE BEGIN USART2_Init 2 */

	/* USER CODE END USART2_Init 2 */
}
//
//
//
//
//
//
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

}
//
//
//
/**
 * @brief  Output Compare callback in non-blocking mode
 * @param  htim TIM OC handle
 * @retval None
 */

void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
	// TIM2_CH1 toggling with frequency = 50 Hz
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1)
	{
		ccr_content = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);
		__HAL_TIM_SET_COMPARE(htim,TIM_CHANNEL_1,ccr_content+pulse1_value);
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_2);

	}

	// TIM2_CH2 toggling with frequency = 1000 Hz
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_2)
	{
		ccr_content = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_2);
		__HAL_TIM_SET_COMPARE(htim,TIM_CHANNEL_2,ccr_content+pulse2_value);
	}

	// TIM2_CH3 toggling with frequency = 2000 Hz
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_3)
	{
		ccr_content = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3);
		__HAL_TIM_SET_COMPARE(htim,TIM_CHANNEL_3,ccr_content+pulse3_value);
	}

	// TIM2_CH4 toggling with frequency = 4000 Hz
	if (htim->Channel == HAL_TIM_ACTIVE_CHANNEL_4)
	{
		ccr_content = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_4);
		__HAL_TIM_SET_COMPARE(htim,TIM_CHANNEL_4,ccr_content+pulse4_value);
	}
}
